<!doctype html>
<html lang='ru'>
<head>
<title>МДК 05.02 МБР</title>
<meta charset='utf-8'>
</head>
<body>
    <h3>Здесь практические работы по PHP</h3>
    <dl>
    <h2> Практическая работа № 1-2 «Создание серверных сценариев с использованием языка PHP»</h2>

    <dt><a href="..\Pr\Pr_1_2\work1.php"> <br>Задача 1 - Получение информации об интерпретаторе (версии) РНР</a> </dt>
    <dd>Вызывается функция phpinfo(), возврвщает информацию об HTTP-сервере</dd>

    <dt><a href="..\Pr\Pr_1_2\work2.php"> <br> Задача 2 - HEREDOC - ситтаксис </a> </dt>
    <dd>Многострочность</dd>
    </dl>

    <dt><a href="..\Pr\Pr_1_2\work3.php"> <br> Задача 3 - Переменные PHP</a> </dt>
    <dd>Описываются различные переменные</dd>
    </dl>

    <dt><a href="..\Pr\Pr_1_2\work4.php"> <br> Задача 4 - Интернет-магазин</a> </dt>
    </dl>

    <dt><a href="..\Pr\Pr_1_2\work5.php"> <br> Задача 5 - Работа с константами</a> </dt>
    <dd>+ Задачи 7 и 13</dd>
    </dl>

    <br><br>*************************************
    <h2> Практическая работа № 3-4 «Создание серверных сценариев с использованием языка PHP»</h2>

    <dt><a href="..\Pr\Pr_3_4\work_3_1.php"> <br> Задача 1 - Действия со случайными числами.</a> </dt>
    <dt><a href="..\Pr\Pr_3_4\work_3_2.php"> <br> Задача 2 - Нахождение значения выражения.</a> </dt>
    <dt><a href="..\Pr\Pr_3_4\work_3_3.php"> <br> Задача 3 - Тернарный оператор.</a> </dt>
    <dt><a href="..\Pr\Pr_3_4\work_3_4.php"> <br> Задача 4 - Арифметическая последовательность.</a> </dt>
    <dt><a href="..\Pr\Pr_3_4\work_3_5.php"> <br> Задача 5 - Накладная.</a> </dt>

    <dt><a href="..\Pr\Pr_3_4\work_3_6_3.php"> <br> Задача 6_3 - вычислить выражение вариант 3.</a> </dt>
    <dt><a href="..\Pr\Pr_3_4\work_3_6_14.php"> <br> Задача 6_14 - вычислить выражение вариант 14.</a> </dt>

    <dt><a href="..\Pr\Pr_3_4\work_3_7.php"> <br> Задача 7 - Школьный возраст?</a> </dt>
    <dt><a href="..\Pr\Pr_3_4\work_3_8.php"> <br> Задача 8 - Ниф, Нуф и Наф (собирали желуди).</a> </dt>
    <dt><a href="..\Pr\Pr_3_4\work_3_9.php"> <br> Задача 9 - Войдет открытка в конверт?.</a> </dt>
    <dt><a href="..\Pr\Pr_3_4\work_3_10.php"> <br> Задача 10 - Какая весовая категория тяжелоатлета?.</a> </dt>
    <dt><a href="..\Pr\Pr_3_4\work_3_11.php"> <br> Задача 11 - Выбор путевки.</a> </dt>
    <dt><a href="..\Pr\Pr_3_4\work_3_12.php"> <br> Задача 12 - Ср. температура в городах.</a> </dt>

    <br>

    <br><br>***...***
    <h2> Практическая работа № 5 </h2>

    <dt><a href="..\Pr\Pr_5\work_5_1.php"> <br> Задача 1. Массив</a> </dt>
    <dt><a href="..\Pr\Pr_5\work_5_2.php"> <br> Задача 2</a> </dt>
    <dt><a href="..\Pr\Pr_5\work_5_3.php"> <br> Задача 3</a> </dt>
    <dt><a href="..\Pr\Pr_5\work_5_4.php"> <br> Задача 4</a> </dt>
    <dt><a href="..\Pr\Pr_5\work_5_5.php"> <br> Задача 5</a> </dt>
    <dt><a href="..\Pr\Pr_5\work_5_6.php"> <br> Задача 6</a> </dt>
    <dt><a href="..\Pr\Pr_5\work_5_7.php"> <br> Задача 7</a> </dt>
    <!-- <dt><a href="..\Pr\Pr_5\work_5_8.php"> <br> Задача 8</a> </dt>
    <dt><a href="..\Pr\Pr_5\work_5_9.php"> <br> Задача 9</a> </dt> -->
    <dt><a href="..\Pr\Pr_5\work_5_10.php"> <br> Задача 10</a> </dt>
    <dt><a href="..\Pr\Pr_5\work_5_11.php"> <br> Задача 11</a> </dt>
    <dt><a href="..\Pr\Pr_5\work_5_12.php"> <br> Задача 12</a> </dt>
    <dt><a href="..\Pr\Pr_5\work_5_13.php"> <br> Задача 13</a> </dt>

    <br><br>*************************************
    <h2> Практическая работа № 6 </h2>

    <dt><a href="..\Pr\Pr_6\"> <br>666</a> </dt>
</body>
</html>