<!doctype html>
<head>
<title>Пр. 3-4 | Задача 1</title>
<meta charset="utf-8">
</head>
<body>

    <?php 
    echo "<p> <a href='../index.php'> К содержанию </a> <br> <br>";

    echo "<p><b>Задача 1-2 - случайные числа</b></p>";

    $x = rand(5, 27); 
    $y = rand(); // любые числа
    echo $x. "<br>". $y. "<br>";

    echo "<p><b>Задача 1-3</b></p>". "<p>Определите две переменные a и b случаями числами от 12 до 25 и от 4 до 11 соответственно.  Выполните вывод всех действий с этими переменными (сложение, вычитание, умножение, деление, возведение в степень и остаток от деления):</p>";

    echo 'A = '.$a = rand(12, 25). ' B = '. $b = rand(4, 11). '<br><br>';

    echo  'A + B = ' .$S = $a + $b. '<br>',
    'A - B = ' .$V = $a - $b.'<br>',
    'A * B = ' .$U = $a * $b.'<br>',
    'A / B = ' .$D = $a / $b.'<br>', 
    'A ^ B = ' .$Stp = pow($a, $b).'<br>',
    'A % B = ' .$OD = intdiv($a, $b).' (Остаток от деления) <br>';


    echo "<p><b>Задача 1-4</b></b></p>". "<p>Скопируйте код и измените в нем диапазон второй переменной (0, 5). Просмотрите результат и допишите код на проверку ошибки: </p>";

    echo 'A = ',$a1 = 24, ' B = ', $b1 = rand(0, 5), '<br><br>';

    echo  'A + B = ' .$S = $a1 + $b1, '<br>', 
    'A - B = ' .$V = $a1 - $b1,'<br>',
    'A * B = ' .$U = $a1 * $b1,'<br>';
    if ($b1 == 0) die("b = 0, На ноль делить нельзя!!!");
    else echo 'A / B = ' .$D = $a1 / $b1,'<br>', 
    'A ^ B = ' .$Stp = pow($a1, $b1),'<br>',
    'A % B = ' .$OD = intdiv($a1, $b1),'<br>';

    ?>
</body>
</html>