<!doctype html>
<head>
<title></title>
<meta charset="utf-8">
</head>
<body>


<?php 
return [

  "HELLO"  => "Добро пожаловать!
  Восхитительные сладости с невероятно вкусной и воздушной текстурой не оставят Вас равнодушными.
  Оригинальная рецептура, потрясающий вкус, использование натуральных ингредиентов и демократичные 
  цены — секрет успеха наших кондитерских изделий.
  У нас Вы можете не только выбрать готовую к продаже продукцию, но и заказать индивидуальный тортик к определенной дате,
  например, ко дню рождения или к свадьбе.",


];

?>


</body>
</html>